let handler = async (m, { conn, command, text }) => {
let love = `

*❆━━━ ─ • ❪☀️❫ • ─ ━━━❆*
             
        
     ♥️ *❈ مرحبا بك في الاستقبال ❈*♠️

            ⊱⋅ ─────• ✿ •───── ⋅⊰
♠️ *❃ الرجاء ملأْ الاستمارة لدخول للقروب الأساسي ❃*                                                              
             
             ⊱⋅ ─────• ✿ •───── ⋅⊰
*☜* اختار لقب شخصية انمي :↫『  』
    
*☜* من اي انمي اخترت اللقب : ↫『  』

*☜* صور لشخصية لقبك : ↫『  』 

*☜* ولد او بنت : ↫『  』

*☜* من طرف : ↫『  』
                ⊱⋅─────•✿•───── ⋅⊰

*كلام مهم✨*
*1*※عند ملأْ الاستمارة منشن احد المشرفين.
*2*※ممنوع ولد يختار لقب بنت والعكس.

               ⊱⋅ ─────• ✿•───── ⋅⊰

✨نقابتنا تتمنا أن تقضي وقتا ممتعا✨
𝕄𝕠𝕠𝕟𝕤✨
                *❆━━━ ─ • ❪☀️❫ • ─ ━━━❆*

 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(استمارهmoon)$/i
export default handler
