let handler = async (m, { conn, command, text }) => {
let love = `

*〖🪽بـسـم اللـه الـࢪحـمـن الࢪحـيـم🪽〗*
✺━─━━⊹◦⊰🪽⊱◦⊹━━─━✺
*◟𝐅.𝐑.𝐌◠⊰┆⊱◡𝐊.𝐆.𝐃🪽◝*
*۞═━═━❑〘🪽〙❑━═━═۞*
تـشـرفــنـا وتــنـورنـا ونــتـمنى مـنـك قــضاء الــوقــت الـممـتـع في ⇊
*〖  〗*
*۞═━═━❑〘🪽〙❑━═━═۞*
*لا تنسى الصوره 🪽🩶*
✽ ━─╌ •⤣★⤤• ╌─━ ✽
*🍂| اللقــب :『』*

*🍂| من اي انمي :『』*

*🍂| الدولة:『』*

*🍂 | العمر:『』*

*۞═━═━❑〘🪽〙❑━═━═۞*
*⧉┋ممنوع ولد ياخد لقب بنت و العكس*
*۞═━═━❑〘🪽〙❑━═━═۞*
*⧉┋📜يرجى قراءة القوانين في الوصف تجنباً للطرد📜┋⧉*
*۞═━═━❑〘🪽〙❑━═━═۞*
*~˼‏૦˹ تــ✍︎ــوقــيــع ↡~*
*◟𝐅.𝐑.𝐌◠⊰┆⊱◡𝐊.𝐆.𝐃🪽◝*

 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(استمارهmagic)$/i
export default handler
