let handler = async (m, { conn, command, text }) => {
let love = `
*┓━━╍╃━━◈〘﷽〙◈━━╄╍━━┏*
*〘 كـوكـب الـظــلال┃🌑┃𝐒𝐇𝐀𝐃𝐎𝐖𝐒 〙*
*╝━━━╍━━◈السلام عليكم◈━━╍━━━╚*
*أبـتـهجـت الـظــلال بتـواجـدك و تـضفـقـت الـجنــود لـلـترحـيـب بـك و غــادرت الشـيـاطـيـن خـائـفـة مـنك و يـا أهــلاً ويـا ســهلاً يـسـعدنـا ان تـكـون جـزء مـن جـنـود الـظــلال وجـزء مـن "كـوكـب الـظــلال" 🌑✨*
*┓⌯━⌯━⌯━⌯━┫🌑┣━⌯━⌯━⌯━⌯┏*
*┃اسـتـمـارة دخـول كـوكـب الـظــلال🌑✨*
*┫⌯━⌯━⌯━⌯━┫🌑┣━⌯━⌯━⌯━⌯╚*
*┃*
*🛂║◞اللـقـب◜✘⁩﹝﹞➺*
*┃*
*🏮║◞الأنـمـي◜✘⁩﹝﹞➺*
*┃*
*🎐║◞مـن طـرف مـيـن◜✘⁩﹝﹞➺*
*┃*
*🚻║◞ولـد ولا بـنـت◜✘⁩﹝﹞➺*
*┃*
*┫⌯━⌯━⌯━⌯━┫🌑┣━⌯━⌯━⌯━⌯┏*
*❏ ║◞المـطــلــوب ⤹┊🌑』*
*┃*
*¹┃◞امـلأ الاسـتـمـاره و مـنـشـن لأحـد مـن الـمـشرفـين◜*
*²┃◞يـكـون مـعاك صـوره للـقـب◜*
*³┃◞أقـراء الـوصـف و شـوف الألـقـاب◜*
*⁴┃◞وأخـتـار لـقـب مـختـلف عـن الـي فـي الـوصـف◜*
*┃*
*╝⌯━⌯━⌯━⌯━┫🌑┣━⌯━⌯━⌯━⌯╚*
*┓⌯━⌯━⌯━⌯━┫🌑┣━⌯━⌯━⌯━⌯┏*
*⧉┃تــ✍︎ــوقــيــع الادراة ⤹〙*
*〘 𝐒•𝐃•𝐒┃كــوكــب الـظــلال 〙*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(استماره)$/i
export default handler
