let handler = async (m, { conn, args, usedPrefix, command }) => {
    conn.relayMessage(m.chat, {
      viewOnceMessage: {
        message: {
          interactiveMessage: {
            header: {
              title: '*قــائــمــة الـــمــــهــ📑ــام*'
            },
            body: {
              text: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*《🌸ان الله وملائـكته يصلون على النبي يا ايها الذين امنو صلو عليه وسلمو تسليما🌸》*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇《اهلا بك ف بوت ميتسوري 》*\n*⏎┇🌸⃝•┇《لعرض القسام البوت أضغط ع القائمة》*\n*⏎┇🌸⃝•┇《اسم البوته┇𝑀𝐼𝑇𝑺𝑈𝑅𝐼》*\n*⏎┇🌸⃝•┇《المنصه┇𝐻𝐸𝑅𝛩𝐾𝑈》*\n*⏎┇🌸⃝•┇《الاصدار V3.0》*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇⪻⫷_𝑀𝐼𝑇𝑺𝑈𝑅𝐼–𝐵𝛩𝑇_⫸≫*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*'
            },
            nativeFlowMessage: {
              buttons: [
                {
                  name: 'single_select',
                  buttonParamsJson: JSON.stringify({
                    title: 'الـــمـــهـــام',
                    sections: [
                      {
                        title: 'List',
                        highlight_label: 'ON',
                        rows: [
                          {
                            header: 'الترفيــ🌸هه',
                            title: '.قسم_الترفيه',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*•┃❖اهلا بك في قسم الترفيــ🌸هه*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.الـمــطـور 】➥*\n*⏎┇🌸⃝•┇【.تــــــــوب 】➥*\n*⏎┇🌸⃝•┇【.الشخصيه】➥*\n*⏎┇🌸⃝•┇【.لــــــــــــو 】➥*\n*⏎┇🌸⃝•┇【.ذكـــــــــاء】➥*\n*⏎┇🌸⃝•┇【.غــــبــــاء 】➥*\n*⏎┇🌸⃝•┇【.حــكــمــه 】➥*\n*⏎┇🌸⃝•┇【.جــمــيــل 】➥*\n*⏎┇🌸⃝•┇【.طــــــلاق 】➥*\n*⏎┇🌸⃝•┇【.تــطقـيـم 】➥*\n*⏎┇🌸⃝•┇【.طــقــــم2】➥*\n*⏎┇🌸⃝•┇【.طــقــمـي 】➥*\n*⏎┇🌸⃝•┇【.خــــروف 】➥*\n*⏎┇🌸⃝•┇【.تـــــــــاج 】➥*\n*⏎┇🌸⃝•┇【.هـــــــــــل】➥*\n*⏎┇🌸⃝•┇【.صـراحــه 】➥*\n*⏎┇🌸⃝•┇【.تـــكــــرار 】➥*\n*⏎┇🌸⃝•┇【.حــــروف 】➥*\n*⏎┇🌸⃝•┇【.تـصـمـيـم 】➥*\n*⏎┇🌸⃝•┇【.ايــديـــت 】➥*\n*⏎┇🌸⃝•┇【.خــــــــط 】➥*\n*⏎┇🌸⃝•┇【.مـــيــمـــز 】➥*\n*⏎┇🌸⃝•┇【.زخــــرفـه 】➥*\n*⏎┇🌸⃝•┇【.قــــلـــــب 】➥*\n*⏎┇🌸⃝•┇【.انــحـراف 】➥*\n*⏎┇🌸⃝•┇【.منحرف  】➥*\n*⏎┇🌸⃝•┇【.كــــــذاب 】➥*\n*⏎┇🌸⃝•┇【.مـــراتـــي 】➥*\n*⏎┇🌸⃝•┇【.اخــتــفـاء 】➥*\n*⏎┇🌸⃝•┇【.رفــــيــــق 】➥*\n*⏎┇🌸⃝•┇【.زوجـــنــي 】➥*\n*⏎┇🌸⃝•┇【.صــــفـــــع 】➥*\n*⏎┇🌸⃝•┇【.رومــنــســي】➥*\n*⏎┇🌸⃝•┇【.خــــيـــانــــه】➥*\n*⏎┇🌸⃝•┇【.خـــلـــفــيـــه】➥*\n*⏎┇🌸⃝•┇【.حــــــضــــــن】➥*\n*⏎┇🌸⃝•┇【.اغـــــنــــيــــه】➥*\n*⏎┇🌸⃝•┇【.تـــعـــلـــيـــق】➥*\n*⏎┇🌸⃝•┇【.تـــــنــــــمــــر】➥*\n*⏎┇🌸⃝•┇【.مجرم 】➥*\n*⏎┇🌸⃝•┇【.زواج 】➥*\n*⏎┇🌸⃝•┇【.ورع 】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا ┇〄*\n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴  〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          },
                          {
                            header: 'الالعـ👾ـاب',
                            title: '.قسم_الالعاب',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم الالعـ👾ـاب*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.ســــؤال 】➥*\n*⏎┇🌸⃝•┇【.كـــــــت 】➥*\n*⏎┇🌸⃝•┇【.ديـــــــن 】➥*\n*⏎┇🌸⃝•┇【.عــــيـــن 】➥*\n*⏎┇🌸⃝•┇【.اكـس او 】➥*\n*⏎┇🌸⃝•┇【.كــــــوره 】➥*\n*⏎┇🌸⃝•┇【.رياضيات 】➥*\n*⏎┇🌸⃝•┇【.تــحــدي 】➥*\n*⏎┇🌸⃝•┇【.فـــكـــك 】➥*\n*⏎┇🌸⃝•┇【.رتـــــــب 】➥*\n*⏎┇🌸⃝•┇【.الــمـــارد 】➥*\n*⏎┇🌸⃝•┇【.ايـمـوجي】➥*\n*⏎┇🌸⃝•┇【.فــــزوره 】➥*\n*⏎┇🌸⃝•┇【.مــوجـي 】➥*\n*⏎┇🌸⃝•┇【.شــبــيـه 】➥*\n*⏎┇🌸⃝•┇【.اعـــــرف 】➥*\n*⏎┇🌸⃝•┇【.عـــــلــــم 】➥*\n*⏎┇🌸⃝•┇【.مـسابــقـه 】➥*\n*⏎┇🌸⃝•┇【.عــــكــــس 】➥*\n*⏎┇🌸⃝•┇【.حــــــــرب 】➥*\n*⏎┇🌸⃝•┇【.عكسعكس 】➥*\n*⏎┇🌸⃝•┇【.انــــمـــــي 】➥*\n*⏎┇🌸⃝•┇【.مسابقه-صور】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا ┇〄* \n*☞┇⌬ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖👾〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          },
                           {
                            header: 'الجــروبـ🌟ـات',
                            title: '.قسم_الجروبات',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في  اوامر الجــروبـ🌟ـات*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.مــنــشـن】➥*\n*⏎┇🌸⃝•┇【.خــفــض】➥*\n*⏎┇🌸⃝•┇【.رفـــــــــع】➥*\n*⏎┇🌸⃝•┇【.جــــروب】➥*\n*⏎┇🌸⃝•┇【.حـــــذف】➥*\n*⏎┇🌸⃝•┇【.انــــــذار】➥* \n*⏎┇🌸⃝•┇【.رفع-انذار】➥*\n*⏎┇🌸⃝•┇【.طـــــــرد】➥*\n*⏎┇🌸⃝•┇【.الجـروب】➥*\n*⏎┇🌸⃝•┇【.لـمـنـشـن】➥*\n*⏎┇🌸⃝•┇【.الادمــــن】➥*\n*⏎┇🌸⃝•┇【.مــخـفــي】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          }
                          {
                            header: 'القـ🕋ـران',
                            title: '.قسم_القران',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم القـ🕋ـران*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.نصيحه】➥*\n*⏎┇🌸⃝•┇【.قران】➥*\n*⏎┇🌸⃝•┇【.اذكار-الصباح】➥*\n*⏎┇🌸⃝•┇【.اذكار-المساء】➥*\n*⏎┇🌸⃝•┇【.الله】➥*\n*⏎┇🌸⃝•┇【.ايه_الكرسي】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🕋〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          },
                          {
                            header: 'التحـ🧚‍♂️ـويل',
                            title: '.قسم_التحويل',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم التحـ🧚‍♂️ـويل*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.لصـــوره】➥*\n*⏎┇🌸⃝•┇【.لفـيـديـو】➥*\n*⏎┇🌸⃝•┇【.خـــــــط】➥*\n*⏎┇🌸⃝•┇【.تليجراف】➥*\n*⏎┇🌸⃝•┇【.مــلـصـق】➥*\n*⏎┇🌸⃝•┇【.ســـرقــه】➥*\n*⏎┇🌸⃝•┇【.بـاركــود】➥*\n*⏎┇🌸⃝•┇【.انــطــق 】➥*\n*⏎┇🌸⃝•┇【.تـحـميــل】➥*\n*⏎┇🌸⃝•┇【.دمــــــــج】➥*\n*⏎┇🌸⃝•┇【.لــصـــوت】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          },
                          {
                            header: 'البنـ💸ـك',
                            title: '.قسم_البنك',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم البنـ💸ـك*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.يـــومــي】➥*\n*⏎┇🌸⃝•┇【.رانــــــك】➥*\n*⏎┇🌸⃝•┇【.راتــــــب】➥*\n*⏎┇🌸⃝•┇【.لــــفــــل】➥*\n*⏎┇🌸⃝•┇【.هــجــوم】➥*\n*⏎┇🌸⃝•┇【.شـــــراء】➥*\n*⏎┇🌸⃝•┇【.شــهــري】➥*\n*⏎┇🌸⃝•┇【.اسبوعي】➥*\n*⏎┇🌸⃝•┇【.بـــنــــك】➥*\n*⏎┇🌸⃝•┇【.عـــمـــل】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇wa.me/201559321760*\n*☞┇𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖💎〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
                            id: 'te'
                          },
                          {
                            header: 'المطـــ🐉ور',
                            title: '.قسم_المطور',
                            description: '*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم المطـــ🐉ور*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*⏎┇🐉⃝•┇【.ضيف_اكس_بي】➥*\n*⏎┇🐉⃝•┇【.بـــــان_شـــــات】➥*\n*⏎┇🐉⃝•┇【.حـذف_بريـميـام】➥*\n*⏎┇🐉⃝•┇【.الــغــاء_الــبــان】➥*\n*⏎┇🐉⃝•┇【.المبندين】➥*\n*⏎┇🐉⃝•┇【.بريميام】➥*\n*⏎┇🐉⃝•┇【.شـــات】➥*\n*⏎┇🐉⃝•┇【.مخفـي】➥*\n*⏎┇🐉⃝•┇【.إعادة】➥*\n*⏎┇🐉⃝•┇【.انضم】➥*\n*⏎┇🐉⃝•┇【.بان】➥*\n*⏎┇🐉⃝•┇【.برا】➥*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇ wa.me/201559321760*\n*☞┇𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴  〖🐉〗*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*',
                            id: 'te'
                          }
                        ]
                      }
                    ]
                  }),
                  messageParamsJson: ''
                }
              ]
            }
          }
        }
      }
    }, {})

}

handler.help = ['info']
handler.tags = ['main']
handler.command = ['القايمه','القائمة','القائمه','القايمة']

export default handler
