let handler = async (m, { conn, command, text }) => {
let love = `

*⧠━──━⧈⇓《🌋》⇓⧈━──━⧠*
*✧║اهلا بك في  اوامر الجــروبـ💫ـات*
*⧠━──━⧈⇓《🌋》⇓⧈━──━⧠*
 *✧║🌋⃝•║《.منشن》*
 *✧║🌋⃝•║《.ترقيه》*
 *✧║🌋⃝•║《.اعفاء》*
 *✧║🌋⃝•║《.جروب》*
 *✧║🌋⃝•║《.المغادره》*
 *✧║🌋⃝•║《.الترحيب》*
 *✧║🌋⃝•║《.حذف》*
 *✧║🌋⃝•║《.انذار》*
 *✧║🌋⃝•║《.حذف-انذار》* 
 *✧║🌋⃝•║《.طرد》*
 *✧║🌋⃝•║《.الجروب》*
 *✧║🌋⃝•║《.لمنشن》*
 *✧║🌋⃝•║《.الادمن》*
 *✧║🌋⃝•║《.مخفي》*
*⧠━──━⧈⇓《🌋》⇓⧈━──━⧠*
*•┃⌬ حقـوق السيد اكيرا✍︎* 
*•┃ا⌬ https://wa.me/201020639057**
*•┃ا⌬┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🐉〗*
*⧠━──━⧈⇓《🌋》⇓⧈━──━⧠*

 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(م3)$/i
export default handler


