
import { prepareWAMessageMedia, generateWAMessageFromContent, getDevice } from '@whiskeysockets/baileys'

const handler = async (m, { conn, text, usedPrefix: prefijo }) => {
    const device = await getDevice(m.key.id);
    const mentionId = m.key.participant || m.key.remoteJid;

    if (device !== 'desktop' || device !== 'web') {      
        var joanimiimg = await prepareWAMessageMedia({ image: {url: 'https://telegra.ph/file/2784677013ba9efe6cc03.jpg'}}, { upload: conn.waUploadToServer })
        const interactiveMessage = {
            body: { text: `*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*《🌸ان الله وملائـكته يصلون على النبي يا ايها الذين امنو صلو عليه وسلمو تسليما🌸》*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇《اهلا بك ف بوت ميتسوري 》*\n*⏎┇🌸⃝•┇《لعرض القسام البوت أضغط ع القائمة》*\n*⏎┇🌸⃝•┇《اسم البوته┇𝑀𝐼𝑇𝑺𝑈𝑅𝐼》*\n*⏎┇🌸⃝•┇《المنصه┇ريندر》*\n*⏎┇🌸⃝•┇《الاصدار V3.0》*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇⪻⫷_𝑀𝐼𝑇𝑺𝑈𝑅𝐼–𝐵𝛩𝑇_⫸≫*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*`.trim() },
            footer: { text: `© Akira`.trim() },  
            header: {
                title: `اهلا بك @${mentionId.split('@')[0]}`,
                subtitle: `𝑀𝐼𝑇𝑺𝑈𝑅𝐼`,
                hasMediaAttachment: true,
                imageMessage: joanimiimg.imageMessage,
            },
            nativeFlowMessage: {
  						buttons: [
  							{
  								name: 'single_select',
  						  	buttonParamsJson: JSON.stringify({
  						  		title: 'الــــمـــهــــام',
  						  		sections: [
  						  			{
  						  				title: 'List',
  							  	    highlight_label: 'ON',
  						  		    rows: [
  						  		    	{
  						  		    		header: 'الترفيــ🌸هه',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*•┃❖اهلا بك في قسم الترفيــ🌸هه*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.الـمــطـور 】➥*\n*⏎┇🌸⃝•┇【.تــــــــوب 】➥*\n*⏎┇🌸⃝•┇【.الشخصيه】➥*\n*⏎┇🌸⃝•┇【.لــــــــــــو 】➥*\n*⏎┇🌸⃝•┇【.ذكـــــــــاء】➥*\n*⏎┇🌸⃝•┇【.غــــبــــاء 】➥*\n*⏎┇🌸⃝•┇【.حــكــمــه 】➥*\n*⏎┇🌸⃝•┇【.جــمــيــل 】➥*\n*⏎┇🌸⃝•┇【.طــــــلاق 】➥*\n*⏎┇🌸⃝•┇【.تــطقـيـم 】➥*\n*⏎┇🌸⃝•┇【.طــقــــم2】➥*\n*⏎┇🌸⃝•┇【.طــقــمـي 】➥*\n*⏎┇🌸⃝•┇【.خــــروف 】➥*\n*⏎┇🌸⃝•┇【.تـــــــــاج 】➥*\n*⏎┇🌸⃝•┇【.هـــــــــــل】➥*\n*⏎┇🌸⃝•┇【.صـراحــه 】➥*\n*⏎┇🌸⃝•┇【.تـــكــــرار 】➥*\n*⏎┇🌸⃝•┇【.حــــروف 】➥*\n*⏎┇🌸⃝•┇【.تـصـمـيـم 】➥*\n*⏎┇🌸⃝•┇【.ايــديـــت 】➥*\n*⏎┇🌸⃝•┇【.خــــــــط 】➥*\n*⏎┇🌸⃝•┇【.مـــيــمـــز 】➥*\n*⏎┇🌸⃝•┇【.زخــــرفـه 】➥*\n*⏎┇🌸⃝•┇【.قــــلـــــب 】➥*\n*⏎┇🌸⃝•┇【.انــحـراف 】➥*\n*⏎┇🌸⃝•┇【.منحرف  】➥*\n*⏎┇🌸⃝•┇【.كــــــذاب 】➥*\n*⏎┇🌸⃝•┇【.مـــراتـــي 】➥*\n*⏎┇🌸⃝•┇【.اخــتــفـاء 】➥*\n*⏎┇🌸⃝•┇【.رفــــيــــق 】➥*\n*⏎┇🌸⃝•┇【.زوجـــنــي 】➥*\n*⏎┇🌸⃝•┇【.صــــفـــــع 】➥*\n*⏎┇🌸⃝•┇【.رومــنــســي】➥*\n*⏎┇🌸⃝•┇【.خــــيـــانــــه】➥*\n*⏎┇🌸⃝•┇【.خـــلـــفــيـــه】➥*\n*⏎┇🌸⃝•┇【.حــــــضــــــن】➥*\n*⏎┇🌸⃝•┇【.اغـــــنــــيــــه】➥*\n*⏎┇🌸⃝•┇【.تـــعـــلـــيـــق】➥*\n*⏎┇🌸⃝•┇【.تـــــنــــــمــــر】➥*\n*⏎┇🌸⃝•┇【.مجرم 】➥*\n*⏎┇🌸⃝•┇【.زواج 】➥*\n*⏎┇🌸⃝•┇【.ورع 】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا ┇〄*\n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴  〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'test'
  						  		    	}
  						  		    ]
  						  			},
  						  			{
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'الالعـ👾ـاب',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم الالعـ👾ـاب*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.ســــؤال 】➥*\n*⏎┇🌸⃝•┇【.كـــــــت 】➥*\n*⏎┇🌸⃝•┇【.ديـــــــن 】➥*\n*⏎┇🌸⃝•┇【.عــــيـــن 】➥*\n*⏎┇🌸⃝•┇【.اكـس او 】➥*\n*⏎┇🌸⃝•┇【.كــــــوره 】➥*\n*⏎┇🌸⃝•┇【.رياضيات 】➥*\n*⏎┇🌸⃝•┇【.تــحــدي 】➥*\n*⏎┇🌸⃝•┇【.فـــكـــك 】➥*\n*⏎┇🌸⃝•┇【.رتـــــــب 】➥*\n*⏎┇🌸⃝•┇【.الــمـــارد 】➥*\n*⏎┇🌸⃝•┇【.ايـمـوجي】➥*\n*⏎┇🌸⃝•┇【.فــــزوره 】➥*\n*⏎┇🌸⃝•┇【.مــوجـي 】➥*\n*⏎┇🌸⃝•┇【.شــبــيـه 】➥*\n*⏎┇🌸⃝•┇【.اعـــــرف 】➥*\n*⏎┇🌸⃝•┇【.عـــــلــــم 】➥*\n*⏎┇🌸⃝•┇【.مـسابــقـه 】➥*\n*⏎┇🌸⃝•┇【.عــــكــــس 】➥*\n*⏎┇🌸⃝•┇【.حــــــــرب 】➥*\n*⏎┇🌸⃝•┇【.عكسعكس 】➥*\n*⏎┇🌸⃝•┇【.انــــمـــــي 】➥*\n*⏎┇🌸⃝•┇【.مسابقه-صور】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا ┇〄* \n*☞┇⌬ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖👾〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'tes'
  						  		    	}
  						  				]
  						  			},
  						  			{
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'الجــروبـ🌟ـات',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في  اوامر الجــروبـ🌟ـات*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.مــنــشـن】➥*\n*⏎┇🌸⃝•┇【.خــفــض】➥*\n*⏎┇🌸⃝•┇【.رفـــــــــع】➥*\n*⏎┇🌸⃝•┇【.جــــروب】➥*\n*⏎┇🌸⃝•┇【.حـــــذف】➥*\n*⏎┇🌸⃝•┇【.انــــــذار】➥* \n*⏎┇🌸⃝•┇【.رفع-انذار】➥*\n*⏎┇🌸⃝•┇【.طـــــــرد】➥*\n*⏎┇🌸⃝•┇【.الجـروب】➥*\n*⏎┇🌸⃝•┇【.لـمـنـشـن】➥*\n*⏎┇🌸⃝•┇【.الادمــــن】➥*\n*⏎┇🌸⃝•┇【.مــخـفــي】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'te'
  						  		    	}
  						  				]
  						  			},
                      	{
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'القـ🕋ـران',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم القـ🕋ـران*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.نصيحه】➥*\n*⏎┇🌸⃝•┇【.قران】➥*\n*⏎┇🌸⃝•┇【.اذكار-الصباح】➥*\n*⏎┇🌸⃝•┇【.اذكار-المساء】➥*\n*⏎┇🌸⃝•┇【.الله】➥*\n*⏎┇🌸⃝•┇【.ايه_الكرسي】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇حقـوق السيد اكيرا┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🕋〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'te'
  						  		    	}
  						  				]
                        },
                      	{
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'التحـ🧚‍♂️ـويل',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم التحـ🧚‍♂️ـويل*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.لصـــوره】➥*\n*⏎┇🌸⃝•┇【.لفـيـديـو】➥*\n*⏎┇🌸⃝•┇【.خـــــــط】➥*\n*⏎┇🌸⃝•┇【.تليجراف】➥*\n*⏎┇🌸⃝•┇【.مــلـصـق】➥*\n*⏎┇🌸⃝•┇【.ســـرقــه】➥*\n*⏎┇🌸⃝•┇【.بـاركــود】➥*\n*⏎┇🌸⃝•┇【.انــطــق 】➥*\n*⏎┇🌸⃝•┇【.تـحـميــل】➥*\n*⏎┇🌸⃝•┇【.دمــــــــج】➥*\n*⏎┇🌸⃝•┇【.لــصـــوت】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇ wa.me/201559321760*\n*☞┋𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖🐉〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'te'
  						  		    	}
  						  				]
                        },
                      	{
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'البنـ💸ـك',
                            title: '.⧠━──━⧈⇓《🌸》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم البنـ💸ـك*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*⏎┇🌸⃝•┇【.يـــومــي】➥*\n*⏎┇🌸⃝•┇【.رانــــــك】➥*\n*⏎┇🌸⃝•┇【.راتــــــب】➥*\n*⏎┇🌸⃝•┇【.لــــفــــل】➥*\n*⏎┇🌸⃝•┇【.هــجــوم】➥*\n*⏎┇🌸⃝•┇【.شـــــراء】➥*\n*⏎┇🌸⃝•┇【.شــهــري】➥*\n*⏎┇🌸⃝•┇【.اسبوعي】➥*\n*⏎┇🌸⃝•┇【.بـــنــــك】➥*\n*⏎┇🌸⃝•┇【.عـــمـــل】➥*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇wa.me/201559321760*\n*☞┇𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴⁵〖💎〗*\n*⧠━──━⧈⇓《🌸》⇓⧈━──━⧠*',
  								    		  id: 'te'
  						  		    	}
  						  				]
                        },
                      {
  						  				highlight_label: 'ON',
  						  				rows: [
  						  					{
  						  		    		header: 'المطـــ🐉ور',
                            title: '.⧠━──━⧈⇓《🐉》⇓⧈━──━⧠',
                            description: '*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*⧉┇اهلا بك في قسم المطـــ🐉ور*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*⏎┇🐉⃝•┇【.ضيف_اكس_بي】➥*\n*⏎┇🐉⃝•┇【.بـــــان_شـــــات】➥*\n*⏎┇🐉⃝•┇【.حـذف_بريـميـام】➥*\n*⏎┇🐉⃝•┇【.الــغــاء_الــبــان】➥*\n*⏎┇🐉⃝•┇【.المبندين】➥*\n*⏎┇🐉⃝•┇【.بريميام】➥*\n*⏎┇🐉⃝•┇【.شـــات】➥*\n*⏎┇🐉⃝•┇【.مخفـي】➥*\n*⏎┇🐉⃝•┇【.إعادة】➥*\n*⏎┇🐉⃝•┇【.انضم】➥*\n*⏎┇🐉⃝•┇【.بان】➥*\n*⏎┇🐉⃝•┇【.برا】➥*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*\n*☜┇ حقـوق السيد اكيرا ┇〄* \n*☞┇ wa.me/201559321760*\n*☞┇𝑇𝐸𝑁𝐷𝛩𝑈, 𝐴𝐾𝐼𝑅𝐴  〖🐉〗*\n*⧠━──━⧈⇓《🐉》⇓⧈━──━⧠*',
  								    		  id: 'te'
  						  		    	}
  						  				]
                      }
  						  		]
  						  	})
  							},
                              {
                                  name: 'quick_reply',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'quick_reply',
                                      id: `message`
                                  })
                              },
                              {
                                  name: 'cta_url',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'url',
                                      url: 'https://www.google.com',
                                      merchant_url: ''
                                  })
                              },
                              {
                                  name: 'cta_call',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'call',
                                      id: 'message'
                                  })
                              },
                              {
                                  name: 'cta_copy',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'copy',
                                      id: '123456789',
                                      copy_code: 'message'
                                  })
                              },
                              {
                                  name: 'cta_reminder',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'cta_reminder',
                                      id: 'message'
                                  })
                              },
                              {
                                  name: 'cta_cancel_reminder',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'cta_cancel_reminder',
                                      id: 'message'
                                  })
                              },
                              {
                                  name: 'address_message',
                                  buttonParamsJson: JSON.stringify({
                                      display_text: 'address_message',
                                      id: 'message'
                                  })
                              },
                              {
                                  name: 'send_location',
                                  buttonParamsJson: JSON.stringify({
                                  })
                              }
  			  		],
                messageParamsJson: ''
            }
        };        

        let msg = generateWAMessageFromContent(m.chat, {
            viewOnceMessage: {
                message: {
                    interactiveMessage,
                },
            },
        }, { userJid: conn.user.jid, quoted: m })
         msg.message.viewOnceMessage.message.interactiveMessage.contextInfo = { mentionedJid: [mentionId] };
        conn.relayMessage(m.chat, msg.message, { messageId: msg.key.id });

    } else {
        conn.sendFile(m.chat, 'JoAnimi•Error.jpg', m);      
    }    
};
handler.help = ['imgboton'];
handler.tags = ['For Test'];
handler.command = /^(القائمة)$/i;
export default handler;


















